CSI API ETABS v1
cDetailing.GetBeamTieRebarData Method
 Retrieves tie (confinement/shear) rebar data for a beam frame object
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetBeamTieRebarData(
	string Name,
	ref int NumberRebarSets,
	ref string[] BarSizeName,
	ref double[] BarArea,
	ref double[] NumberLegs,
	ref string[] Location,
	ref double[] ClearCover,
	ref double[] StartCoord1,
	ref double[] Spacing,
	ref double[] Lengths,
	ref string[] RebarSetGUID
)
Function GetBeamTieRebarData (
	Name As String,
	ByRef NumberRebarSets As Integer,
	ByRef BarSizeName As String(),
	ByRef BarArea As Double(),
	ByRef NumberLegs As Double(),
	ByRef Location As String(),
	ByRef ClearCover As Double(),
	ByRef StartCoord1 As Double(),
	ByRef Spacing As Double(),
	ByRef Lengths As Double(),
	ByRef RebarSetGUID As String()
) As Integer
Dim instance As cDetailing
Dim Name As String
Dim NumberRebarSets As Integer
Dim BarSizeName As String()
Dim BarArea As Double()
Dim NumberLegs As Double()
Dim Location As String()
Dim ClearCover As Double()
Dim StartCoord1 As Double()
Dim Spacing As Double()
Dim Lengths As Double()
Dim RebarSetGUID As String()
Dim returnValue As Integer
returnValue = instance.GetBeamTieRebarData(Name,
	NumberRebarSets, BarSizeName, BarArea,
	NumberLegs, Location, ClearCover,
	StartCoord1, Spacing, Lengths, RebarSetGUID)
int GetBeamTieRebarData(
	String^ Name,
	int% NumberRebarSets,
	array<String^>^% BarSizeName,
	array<double>^% BarArea,
	array<double>^% NumberLegs,
	array<String^>^% Location,
	array<double>^% ClearCover,
	array<double>^% StartCoord1,
	array<double>^% Spacing,
	array<double>^% Lengths,
	array<String^>^% RebarSetGUID
)
abstract GetBeamTieRebarData :
        Name : string *
        NumberRebarSets : int byref *
        BarSizeName : string[] byref *
        BarArea : float[] byref *
        NumberLegs : float[] byref *
        Location : string[] byref *
        ClearCover : float[] byref *
        StartCoord1 : float[] byref *
        Spacing : float[] byref *
        Lengths : float[] byref *
        RebarSetGUID : string[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing beam frame object
NumberRebarSets
Type: System.Int32
 Number of tie rebar sets for this beam object
BarSizeName
Type: System.String[]
 Rebar designation
BarArea
Type: System.Double[]
 Individual rebar area
NumberLegs
Type: System.Double[]
 Number of legs for ties in this set (legs are in the local 2 direction)
Location
Type: System.String[]
 Zone of this set of rebars - A, B, C, etc. (See picture for seismic/ non-seismic detailing)
ClearCover
Type: System.Double[]
 Clear cover from beam face to ties being specified
StartCoord1
Type: System.Double[]
 Start of this set of tie rebars from start/end (depends on location) of beam object
Spacing
Type: System.Double[]
 Spacing of ties
Lengths
Type: System.Double[]
 Length over which these tie bars are provided from start point
RebarSetGUID
Type: System.String[]
 The GUIDs of each of the rebar sets (could be duplicated for adjacent beam if rebars are continuous)
Return Value
Type: Int32
 Returns zero if the rebar data is successfully retrieved; otherwise it returns a nonzero value.
See Also
Reference
cDetailing Interface
ETABSv1 Namespace